// // - створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б

// // ----------1st version-------------------------------------------------------------------
// function rectangleArea(a, b) {
//     let res = a * b;
//     return (res);
// }
// console.log(rectangleArea(5, 4));

// // ----------2st version-------------------------------------------------------------------
// let rectangleArea = (a, b) => a * b;
// console.log(rectangleArea(5, 4));




//==================================================================================================================
// // - створити функцію яка обчислює та повертає площу кола з радіусом r
// function circleArea(p, r) {
//     let res = p * (r * r);
////   let res = p * Math.pow(r, 2);
//     return (res);
// }
// console.log(circleArea(3.14, 5));



//==================================================================================================================
// // - створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r
//
// function cylinderArea (p, h, r) {
//     let res = 2 * p * h * r;
//     return (res);
// }
// console.log(cylinderArea(3.14, 30, 5));




//==================================================================================================================
// // - створити функцію яка приймає масив та виводить кожен його елемент
// // ----------1st version-------------------------------------------------------------------
// function arrays (...xxx) {
//     for (let i = 0; i < xxx.length; i++){
//         let arr = xxx[i];
//         console.log(arr);
//     }
// }
//
// arrays([13, 58, 33, 45, 55, 102, 'string', [true, 'string', 18]]);

// // ----------2nd version-------------------------------------------------------------------
// function showArrays (...array) {
//     for (const arrayElement of array) {
//         console.log(arrayElement)
//     }
// }
// showArrays([13,  25, 65, 58, 3, 'string']);




//==================================================================================================================
// // - створити функцію яка створює параграф з текстом. Текст задати через аргумент
//
// function text(paragraph) {
//     document.write(`<p>${paragraph}</p>`);
// }
//
// text('Книга «Янголи і демони» – динамічна, пригодницька, трішки містична і релігійна детективна історія від майстра жанру – Дена Брауна. Хто читав його попередній бестселер «Код да Вінчі», навіть сумніватися не буде щодо наступних творів письменника. ');




//==================================================================================================================
// // - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий
// function threeElems (text){
//         document.write(`<ul>`)
//         for (let i = 0; i < 3; i++) {
//                 document.write(`<li><p>${text}</p></li>`)
//         }
//         document.write(`</ul>`);
// }
// threeElems('It was a beautiful sunny day.', 'Nothing special was going to happen.', 'Suddenly the sky became cloudy.')

//-------------------------------------------------------------------------------------------------------------
// // - my own additional task (just for me)

// function threeElems(a, b, c) {
//         document.write(
//             `<ul>
//                     <li><p>${a}</p></li>
//                     <li><p>${b}</p></li>
//                     <li><p>${c}</p></li>
//             </ul>`);
// }
// threeElems('It was a beautiful sunny day', 'Nothing special was going to happen.', 'Suddenly the sky became cloudy');




//==================================================================================================================
// // - створити функцію яка створює ul з трьома елементами li.
// // Текст li задати через аргумент всім однаковий.
// // Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)
//
// function creatLiElem(a, num) {
//         document.write(`<ul>`);
//
//         if (num) {
//                 for (let i = 0; i < num; i++) {
//                         document.write(`<li>${a}</li>`)
//                 }
//
//         }
//
//         document.write(`</ul>`);
// }
// creatLiElem('Whach a cartoon!', 5);




//==================================================================================================================
// // - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список
//
// function creatList (array) {
//         document.write('<ul>');
//         for (const arrElement of array) {
//                 document.write(`<li>${arrElement}</li>`);
//         }
//         document.write('</ul>');
// }
// creatList([25, 'Okten', true, 5, false, [11, 22, 33]]);



//==================================================================================================================
// // - створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об'єкту окремий блок.
//
// let users = [
//         {id: 1, name: 'Vasia',age:36},
//         {id: 2, name: 'Anna', age:30},
//         {id: 3, name: 'Nazar', age:25},
//         {id: 4, name: 'Nastia', age:18},
//         {id: 5, name: 'Valery', age:37},
//         {id: 6, name: 'Halyna', age:20},
//         {id: 7, name: 'Iryna', age:37}
// ];
//
//
// function userList (arr) {
//         for (const item of arr) {
//                 document.write(`<div>Id: ${item.id}, Name: ${item.name}, Age: ${item.age}</div>`);
//         }
// }
// userList(users);




//=================================================!!!!!!!!!!!!!!!!!!!!=================================================================
// // - створити функцію яка повертає найменьше число з масиву
// let array = [13,15,55,24,8,88];
// function minNum(arr) {
//     let min = arr[0];
//
//     for(let i = 1; i < arr.length; i++) {
//         if (min > arr[i]) {
//             min = arr[i];
//         }
//     }
//
//     return min;
// }
//
// console.log(minNum(array));

//==================================================================================================================
// // - створити функцію яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад [1,2,10]->13
// function sumElem (...arr) {
//     let sum = arr[0];
//
//     for (let i = 1; i < arr.length; i++) {
//         sum += arr[i];
//     //    // sum = sum + arr[i];
//     }
//
//     return sum;
// }
// console.log(sumElem(10, 20, 5));